---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo.HostLocalCoordinateSystem
enum: Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo
source: html/279381f9-454a-56d1-392b-c62dd7eea56a.htm
---
# Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo.HostLocalCoordinateSystem

Boundary condition is oriented in respect to it analytical host element coordinate system and will follow host changes.